**How to Query the USA Names Data (BigQuery Dataset)**

In [1]:
import bq_helper
from bq_helper import BigQueryHelper
# https://www.kaggle.com/sohier/introduction-to-the-bq-helper-package
usa = bq_helper.BigQueryHelper(active_project="bigquery-public-data",
                                   dataset_name="usa_names")

In [2]:
bq_assistant = BigQueryHelper("bigquery-public-data", "usa_names")
bq_assistant.list_tables()

['usa_1910_2013', 'usa_1910_current']

In [3]:
bq_assistant.head("usa_1910_current", num_rows=15)

   state gender  year      name  number
0     OH      F  2014      Dani      13
1     OH      F  2013     Jacey       7
2     AK      M  1957   Vincent       6
3     CA      M  1921  Mitchell       7
4     DC      M  1940     Irvin       8
5     FL      M  1974  Marshall      17
6     NC      F  2009   Kenadie       6
7     AR      F  1972     Sonja      18
8     SC      F  2000      Amya      10
9     AR      F  1940    Jannie       8
10    TN      M  1922      Fred     249
11    NE      M  1967     Kenny       8
12    WI      M  1925   Orville      57
13    PA      M  1915     Mearl       5
14    VA      F  2002     Kelsi       9

In [4]:
bq_assistant.table_schema("usa_1910_current")

[SchemaField('state', 'STRING', 'NULLABLE', '2-digit state code', ()),
 SchemaField('gender', 'STRING', 'NULLABLE', 'Sex (M=male or F=female)', ()),
 SchemaField('year', 'INTEGER', 'NULLABLE', '4-digit year of birth', ()),
 SchemaField('name', 'STRING', 'NULLABLE', 'Given name of a person at birth', ()),
 SchemaField('number', 'INTEGER', 'NULLABLE', 'Number of occurrences of the name', ())]

What are the most common names?

In [5]:
query1 = """
  SELECT
  names_step_1.name AS names_step_1_name,
  names_step_1.gender AS names_step_1_gender,
  COALESCE(CAST(SUM(names_step_1.number) AS FLOAT64),0) AS namesstep1totalpopulat_1
FROM
  `bigquery-public-data.usa_names.usa_1910_2013` AS names_step_1
GROUP BY
  1,
  2
ORDER BY
  3 DESC
LIMIT
  500;
        """
response1 = usa.query_to_pandas_safe(query1)
response1.head(50)

   names_step_1_name names_step_1_gender  namesstep1totalpopulat_1
0              James                   M                 4924235.0
1               John                   M                 4818746.0
2             Robert                   M                 4703680.0
3            Michael                   M                 4280040.0
4            William                   M                 3811998.0
5               Mary                   F                 3728041.0
6              David                   M                 3541625.0
7            Richard                   M                 2526927.0
8             Joseph                   M                 2467298.0
9            Charles                   M                 2237170.0
10            Thomas                   M                 2209169.0
11       Christopher                   M                 1980717.0
12            Daniel                   M                 1838509.0
13          Patricia                   F                 1567405.0
14           Matthew                   M                 1535407.0
15         Elizabeth                   F                 1490772.0
16          Jennifer                   F                 1460272.0
17             Linda                   F                 1445838.0
18           Barbara                   F                 1422631.0
19            Donald                   M                 1400589.0
20           Anthony                   M                 1381676.0
21              Paul                   M                 1353757.0
22              Mark                   M                 1337534.0
23            George                   M                 1316531.0
24            Steven                   M                 1267733.0
25           Kenneth                   M                 1258091.0
26            Andrew                   M                 1226185.0
27            Edward                   M                 1208595.0
28            Joshua                   M                 1160468.0
29             Brian                   M                 1154168.0
30             Kevin                   M                 1146126.0
31          Margaret                   F                 1120006.0
32             Susan                   F                 1107916.0
33            Ronald                   M                 1072932.0
34           Timothy                   M                 1054028.0
35           Dorothy                   F                 1051262.0
36           Jessica                   F                 1036257.0
37             Sarah                   F                 1006050.0
38             Jason                   M                 1005966.0
39             Betty                   F                  983791.0
40             Nancy                   F                  983374.0
41             Karen                   F                  981409.0
42           Jeffrey                   M                  967716.0
43              Lisa                   F                  961678.0
44              Gary                   M                  895996.0
45             Helen                   F                  894826.0
46              Ryan                   M                  889757.0
47            Sandra                   F                  870181.0
48          Nicholas                   M                  865895.0
49              Eric                   M                  860028.0

What are the most common female names?

In [6]:
query2 = """
  SELECT
  names_step_1.name AS names_step_1_name,
  COALESCE(CAST(SUM(names_step_1.number) AS FLOAT64),0) AS namesstep1totalpopulat_1
FROM
  `bigquery-public-data.usa_names.usa_1910_2013` AS names_step_1
WHERE
  (names_step_1.gender = 'F')
GROUP BY
  1
ORDER BY
  2 DESC
LIMIT
  500;
        """
response2 = usa.query_to_pandas_safe(query2)
response2.head(50)

   names_step_1_name  namesstep1totalpopulat_1
0               Mary                 3728041.0
1           Patricia                 1567405.0
2          Elizabeth                 1490772.0
3           Jennifer                 1460272.0
4              Linda                 1445838.0
5            Barbara                 1422631.0
6           Margaret                 1120006.0
7              Susan                 1107916.0
8            Dorothy                 1051262.0
9            Jessica                 1036257.0
10             Sarah                 1006050.0
11             Betty                  983791.0
12             Nancy                  983374.0
13             Karen                  981409.0
14              Lisa                  961678.0
15             Helen                  894826.0
16            Sandra                  870181.0
17            Ashley                  830106.0
18             Donna                  826361.0
19          Kimberly                  824429.0
20             Carol                  811954.0
21          Michelle                  801645.0
22             Emily                  779413.0
23            Amanda                  768465.0
24             Laura                  745290.0
25           Melissa                  744479.0
26           Deborah                  735472.0
27         Stephanie                  731654.0
28           Rebecca                  728484.0
29              Ruth                  728315.0
30              Anna                  719411.0
31            Sharon                  718112.0
32          Kathleen                  702969.0
33           Cynthia                  702577.0
34           Shirley                  679653.0
35               Amy                  672802.0
36            Angela                  653194.0
37          Virginia                  621243.0
38         Catherine                  605850.0
39            Brenda                  603563.0
40         Katherine                  593004.0
41            Pamela                  591193.0
42            Nicole                  576131.0
43         Christine                  573761.0
44             Janet                  550385.0
45          Samantha                  548181.0
46             Debra                  547670.0
47           Carolyn                  547665.0
48            Rachel                  544826.0
49           Frances                  529027.0

What are the names of 50 people in Texas?

In [7]:
query3 = """  
    SELECT name FROM `bigquery-public-data.usa_names.usa_1910_2013` 
    WHERE state = "TX" 
    LIMIT 100;
        """
response3 = usa.query_to_pandas_safe(query3)
response3.head(50)

         name
0     Frances
1       Alice
2    Beatrice
3        Ella
4    Gertrude
5   Josephine
6        Lula
7     Blanche
8    Marjorie
9   Christine
10  Margarita
11       Alta
12       Sara
13      Naomi
14      Sofia
15     Andrea
16    Delfina
17    Dominga
18     Elnora
19      Adele
20    Rafaela
21      Dixie
22      Luisa
23       Bess
24  Ernestine
25     Lorine
26      Patsy
27    Cecelia
28  Enriqueta
29    Lucinda
30      Alyce
31      Oneta
32   Apolonia
33     Gloria
34      Rhoda
35       Buna
36       Maye
37      Pansy
38     Gladys
39      Maria
40      Helen
41      Velma
42      Clara
43       Anna
44     Evelyn
45       Rosa
46        Mae
47    Bernice
48     Stella
49     Vivian